app/services/jwt_service.rb

  def self.decode(token)
    return nil if Blacklist.exists?(token: token)
---
SELECT 1 AS one FROM "blacklists" WHERE "blacklists"."token" = $1 LIMIT $2  [["token", "[FILTERED]"], ["LIMIT", 1]]