app/controllers/application_controller.rb

  def authenticate_request
    auth_header = request.headers['Authorization']
    if auth_header.present?
      token = auth_header.split(' ').last
      payload = JwtService.decode(token)
      if payload
        current_time = Time.now.to_i
        if payload[:exp] > current_time
          @current_user = User.find_by(id: payload[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]