app/controllers/products_controller.rb

SELECT "products".* FROM "products"
---
  def index
    @products = Product.all

INSERT INTO "products" ("name", "description", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Product"], ["description", "Test description"], ["price", "19.99"], ["created_at", "2024-08-09 01:18:18.110236"], ["updated_at", "2024-08-09 01:18:18.110236"]]
---
  def create
    @product = Product.new(product_params)

    if @product.save