app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "vechicin"], ["password_digest", "[FILTERED]"], ["created_at", "2024-08-09 01:09:55.887302"], ["updated_at", "2024-08-09 01:09:55.887302"]]
---
  def create
    @user = User.new(user_params)

    if @user.save